# AICP Intership Task Week 2

## Import Libraries

In [1]:
import pandas as pd

## Question No 1

Writer pandas series code to get following output without using dictionary:

## Answer

In [2]:
data = [1, 4, 9, 6, 7]
index = ['a', 'x', 'c', '2', 'e']

series = pd.Series(data, index=index)
print(series)

a    1
x    4
c    9
2    6
e    7
dtype: int64

## Question No 2

Q.2: Writer pandas series code to get following output using dictionary:

## Answer

In [3]:
dic = {'Bilal': 42, 'Ayesha': 38, 'Hadia': 39}

series = pd.Series(dic)
print(series)

Bilal     42
Ayesha    38
Hadia     39
dtype: int64

## Question No 3

Write pandas dataframe code to get following output using python dictionary

## Answer

In [24]:
data = {
    'day': ['1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017', '1/5/2017', '1/6/2017'],
    'temperature': [32, 35, 28, 24, 32, 31],
    'windspeed': [6, 7, 2, 7, 4, 2],
    'event': [ 'Rain', 'Sunny', 'Snow', 'Snow', 'Rain','Sunny']
}

df = pd.DataFrame(data)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

## Question No 4

In extension to above question, you are required to replace index by ['a','b','c','d','e','f']
## Answer

In [25]:
df.index = ['a', 'b', 'c', 'd', 'e', 'f']
df

        day  temperature  windspeed  event
a  1/1/2017           32          6   Rain
b  1/2/2017           35          7  Sunny
c  1/3/2017           28          2   Snow
d  1/4/2017           24          7   Snow
e  1/5/2017           32          4   Rain
f  1/6/2017           31          2  Sunny

## Question No 5

In extension to above Q.3, calculate mean, miximum and minimum for label “temperature”

## Answer

In [26]:
mean_temperature = df['temperature'].mean()
print("Mean Temperature:", mean_temperature)

Mean Temperature: 30.333333333333332

In [27]:
max_temperature = df['temperature'].max()
print("Maximum Temperature:", max_temperature)

Maximum Temperature: 35

In [28]:
min_temperature = df['temperature'].min()
print("Minimum Temperature:", min_temperature)

Minimum Temperature: 24

## Question No 6

Import CSV ‘people.csv’ in the given folder. Keep in mind the following instructions:
- You’re required to import only specific columns ["First Name", "Sex", "Email", “Phone”, “Job Title”] 
- Set the following columns ["Sex", "Job Title"] as index columns
- Skip following rows [1,5]
- Export the CSV as “NewPeople.csv”

## Answer

- Import the File

In [106]:
file_path = 'C:\\Users\\PMLS\\Desktop\\\EDA Internship 2.0 Week 2\\people.csv'

df2 = pd.read_csv(file_path)

- Import the specipic columns

In [59]:
columns_to_import = ["First Name", "Sex", "Email", "Phone", "Job Title"]
df2.head()

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
0,1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
1,2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
2,3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath
3,4,A31Bee3c201ef58,Yesenia,Martinez,Male,kaitlinkaiser@example.com,584.094.6111,2017-08-03,Market researcher
4,5,1bA7A3dc874da3c,Lori,Todd,Male,buchananmanuel@example.net,689-207-3558x7233,1938-12-01,Veterinary surgeon

- Set Index and Skip the row 2

In [61]:
index_columns = ["Sex", "Job Title"]
skip_rows = [1, 5]

df2 = pd.read_csv(file_path, usecols=columns_to_import, skiprows=skip_rows)
df2.set_index(index_columns, inplace=True)
df2.head()

- Export the File

In [63]:
df2.to_csv('NewPeople.csv')
print("CSV file exported successfully as 'NewPeople.csv'")

CSV file exported successfully as 'NewPeople.csv'

## Question No 7

Import excel sheet ‘SampleWork.xlsx’ in the given folder. Keep in mind the following instructions: 
- Import sheet 1
- Import only first and last column from sheet 1 
- Skip row 2 while importing the sheet
- Set row 2 as header export as new sheet.


## Answer

In [102]:
path = 'C:\\Users\\PMLS\\Desktop\\EDA Internship 2.0 Week 2\\SampleWork.xlsx'

df3 = pd.read_excel(path, sheet_name=0, usecols=[0, 3], skiprows=[1],header=[1])
df3

    Bilal  90
0  Sufyan  85
1   Saiqa  80
2   Aimen  75

- Export the file

In [103]:
df3.to_excel('new_sheet.xlsx')
print("Excel file exported successfully as 'new-sheet.xlsx'")

Excel file exported successfully as 'new-sheet.xlsx'

## Question No 8

Create the following dataframe as AICP_DF then implement different operations as described below: 
- select 'Name', 'Qualification' coloumns and save to df1
- add a new column to AICP_DF “Height” with the following values: [5.1, 6.2, 5.1, 5.2,5.1] 
- set column “Name” as the index column.
- retrieve row with index “Hifza” retrieve row with index 3 
- drop row with index “Bilal”


## Answer

In [124]:
data = {
    'Name': ['Sonia', 'Bilal', 'Hifza', 'Kabir', 'Jazim'],
    'Age': [27, 24, 22, 32, 23],
    'Address': ['Lahore', 'Karachi', 'Sialkot', 'Peshawar', 'lhr'],
    'Qualification': ['Msc', 'MA', 'MCA', 'Phd', 'bsc']
}

AICP_DF = pd.DataFrame(data)
AICP_DF

    Name  Age   Address Qualification
0  Sonia   27    Lahore           Msc
1  Bilal   24   Karachi            MA
2  Hifza   22   Sialkot           MCA
3  Kabir   32  Peshawar           Phd
4  Jazim   23       lhr           bsc

In [125]:
# Selecting 'Name' and 'Qualification' columns and saving to df1
df1 = AICP_DF[['Name', 'Qualification']]
print("\nDataFrame df1:")
df1

DataFrame df1:

    Name Qualification
0  Sonia           Msc
1  Bilal            MA
2  Hifza           MCA
3  Kabir           Phd
4  Jazim           bsc

In [126]:
# Adding a new column "Height" to AICP_DF
AICP_DF['Height'] = [5.1, 6.2, 5.1, 5.2, 5.1]
AICP_DF

    Name  Age   Address Qualification  Height
0  Sonia   27    Lahore           Msc     5.1
1  Bilal   24   Karachi            MA     6.2
2  Hifza   22   Sialkot           MCA     5.1
3  Kabir   32  Peshawar           Phd     5.2
4  Jazim   23       lhr           bsc     5.1

In [127]:
# Setting the column "Name" as the index column
AICP_DF.set_index('Name', inplace=True)
AICP_DF

       Age   Address Qualification  Height
Name
Sonia   27    Lahore           Msc     5.1
Bilal   24   Karachi            MA     6.2
Hifza   22   Sialkot           MCA     5.1
Kabir   32  Peshawar           Phd     5.2
Jazim   23       lhr           bsc     5.1

In [128]:
# Retrieving row with index "Hifza" and row with index 3
row_hifza = AICP_DF.loc['Hifza']
print("\nRow with index 'Hifza':")
row_hifza

Row with index 'Hifza':

Age                   22
Address          Sialkot
Qualification        MCA
Height               5.1
Name: Hifza, dtype: object

In [129]:
row_3 = AICP_DF.iloc[3]
print("\nRow with index 3:")
row_3

Row with index 3:

Age                    32
Address          Peshawar
Qualification         Phd
Height                5.2
Name: Kabir, dtype: object

In [130]:
# Dropping row with index "Bilal"
AICP_DF.drop('Bilal', inplace=True)
print("Droped the row with Index Bilal")
AICP_DF

Droped the row with Index Bilal

       Age   Address Qualification  Height
Name
Sonia   27    Lahore           Msc     5.1
Hifza   22   Sialkot           MCA     5.1
Kabir   32  Peshawar           Phd     5.2
Jazim   23       lhr           bsc     5.1